---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilderOutcome
source: html/d0512eec-4b27-81a4-9327-98eaf1fedf12.htm
---
# Autodesk.Revit.DB.BRepBuilderOutcome

This class defines possible outcomes returned by BRepBuilder functions that need to report outcome via a return value.

## Syntax (C#)
```csharp
public enum BRepBuilderOutcome
```